In [1]:
import warnings
warnings.filterwarnings('ignore')

import pandas as pd
import numpy as np

# TEST3

In [5]:
df = pd.read_csv('dataset/tweets2.csv', index_col='No')

In [10]:
df['totalSum'] = df.iloc[:, 3:].apply(lambda x: x.sum(), axis=1)

# Q1
# 위의 전처리한 데이터를 이용하여 리-트윗 횟수(retweets)가 0이 아닌 트윗을 대상으로
# 실시간 중계 여부(atConference)에 따른 좋아요(‘likes’) 클릭 수에 평균을 출력하세요.

In [16]:
df[df['retweets'] != 0].groupby('atConference')['likes'].mean()

atConference
False    15.862069
True      2.269231
Name: likes, dtype: float64

# TEST4

In [17]:
df = pd.read_csv('dataset/travel_insurance2.csv')
df.head()

,NO,Agency,AgencyType,DistributionChannel,ProductName,Claim,Duration,Destination,NetSales,Commision,Gender,Age
0,1,CBH,Travel Agency,Offline,Comprehensive Plan,No,186,MALAYSIA,-29.0,9.57,F,81
1,2,CBH,Travel Agency,Offline,Comprehensive Plan,No,186,MALAYSIA,-29.0,9.57,F,71
2,3,CWT,Travel Agency,Online,Rental Vehicle Excess Insurance,No,65,AUSTRALIA,-49.5,29.70,NaN,32
3,4,CWT,Travel Agency,Online,Rental Vehicle Excess Insurance,No,60,AUSTRALIA,-39.6,23.76,NaN,32
4,5,CWT,Travel Agency,Online,Rental Vehicle Excess Insurance,No,79,ITALY,-19.8,11.88,NaN,41

In [19]:
df = df.replace({'Null': np.nan, 'N/A': np.nan, '': np.nan})
df.shape

(63326, 12)

# 1-1.

In [20]:
df = df.drop(columns=['ProductName', 'NetSales'])

# 1-2.

In [21]:
df['Gender'].isna().sum()

45107

In [22]:
df.loc[(df['Gender'].isna()) & (df['NO'] % 2 == 0), 'Gender'] = 'M'
df.loc[(df['Gender'].isna()) & (df['NO'] % 2 != 0), 'Gender'] = 'F'

In [24]:
df['Gender'].isna().sum()

0

In [25]:
basetable1 = df.copy()

# Q1.

In [28]:
basetable1[(basetable1['Age'] >= 40) & (basetable1['Age'] < 50 ) & (basetable1['Gender'] == 'F')]\
    ['Destination'].value_counts().index[1]

'MALAYSIA'

# Test5

In [33]:
df = pd.read_csv('dataset/Train_data.csv')
df.head(2)

,ID,join_date,sex,birth_year,branch_code,P1,P2,P3,P4,P5,...,P12,P13,P14,P15,P16,P17,P18,P19,P20,P21
0,4WKQSBB,1/2/2019,F,1987,1X1H,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0
1,CP5S02H,1/6/2019,F,1981,UAOD,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0

## 1-1

In [36]:
df = df.dropna(subset=['join_date'])

In [39]:
df['reg_age'] = df['join_date'].str[-4:].astype(int) - df['birth_year'] + 1
# pd.to_datetime(df['join_date'], format='%d/%m/%Y').dt.year - df['birth_year'] + 1

In [41]:
df.head(2)

,ID,join_date,sex,birth_year,branch_code,P1,P2,P3,P4,P5,...,P13,P14,P15,P16,P17,P18,P19,P20,P21,reg_age
0,4WKQSBB,1/2/2019,F,1987,1X1H,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,33
1,CP5S02H,1/6/2019,F,1981,UAOD,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,39

## 1-2

In [54]:
df['VIP'] = np.where(df.filter(regex='^P').sum(axis=1) >= 4, 'VIP', 'Not VIP')

In [55]:
df.head(2)

,ID,join_date,sex,birth_year,branch_code,P1,P2,P3,P4,P5,...,P14,P15,P16,P17,P18,P19,P20,P21,reg_age,VIP
0,4WKQSBB,1/2/2019,F,1987,1X1H,0,0,0,0,0,...,0,1,0,0,0,0,0,0,33,Not VIP
1,CP5S02H,1/6/2019,F,1981,UAOD,0,0,0,0,0,...,0,1,0,0,0,0,0,0,39,Not VIP

In [56]:
df.shape

(29130, 28)

# Q1.

### 가장 큰 사무소

In [58]:
df.groupby('branch_code')['reg_age'].mean().idxmax()

'49BM'

### 세번째로 큰 사무소

In [61]:
df.groupby('branch_code')['reg_age'].mean().sort_values(ascending=False).index[2]

'EU3L'

# Q2.

In [62]:
df['total'] = df.filter(regex='^P').sum(axis=1)

In [64]:
df.head(2)

,ID,join_date,sex,birth_year,branch_code,P1,P2,P3,P4,P5,...,P15,P16,P17,P18,P19,P20,P21,reg_age,VIP,total
0,4WKQSBB,1/2/2019,F,1987,1X1H,0,0,0,0,0,...,1,0,0,0,0,0,0,33,Not VIP,2
1,CP5S02H,1/6/2019,F,1981,UAOD,0,0,0,0,0,...,1,0,0,0,0,0,0,39,Not VIP,2

In [66]:
df.groupby(['birth_year', 'sex'])['total'].sum().idxmax()

(1983, 'M')

# Q3.

In [72]:
df[df['birth_year'] <= 1990][['P1', 'P21']].corr().round(2).iloc[0, 1]

0.01

# Q4.

In [82]:
tmp = df[(df['birth_year'] <= 1980) & (df['sex'] == 'F')]

In [86]:
pd.crosstab(index=tmp['branch_code'], columns=tmp['VIP']).sort_values(by='VIP', ascending=False)
# tmp.groupby(['branch_code', 'VIP']).size().unstack('VIP').sort_values(by='VIP', ascending=False)

VIP          Not VIP  VIP
branch_code
748L            1045   50
94KC             529   35
E5SW             677   35
30H5             515   19
UAOD             547   14
XX25             472   13
ZFER             145   13
O67J             106    6
1X1H             145    5
49BM             104    5
9F9T              44    1
X23B              15    1
BOAS              42    0

# Q5

In [98]:
# df[pd.to_datetime(df['join_date'], format='%d/%m/%Y').dt.month <= 6]

In [99]:
df[df['join_date'].str.split('/').str[1].astype(int) <= 6].groupby('sex')['reg_age'].mean()

sex
F    40.314175
M    39.233391
Name: reg_age, dtype: float64

In [100]:
round(abs(40.314175 - 39.233391), 1)

1.1